diplom-result/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-result/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//ВКМ
	
	Адрес = Параметры.АдресВХранилище;
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.ВКМ_Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		Точка.Текст = Строка.ВКМ_Сотрудник;
		Серия.Текст = "Отпуск";
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ВКМ_ДатаНачала;
		Интервал.Конец = Строка.ВКМ_ДатаОкончания;
		
		СтрокаТаблицы = Объект.ВКМ_ОтпускаСотрудников.Добавить();
		СтрокаТаблицы.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
		СтрокаТаблицы.ВКМ_ДатаНачала = Строка.ВКМ_ДатаНачала;
		СтрокаТаблицы.ВКМ_ДатаОкончания = Строка.ВКМ_ДатаОкончания;
		
		КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти
